<?php

return [
    'scalar' => 'Фильтр по полю :attribute должен быть строкой.',
    'like' => 'Фильтр по полю :attribute содержит недопустимое количество символов.',
    'list' => 'Фильтр по полю :attribute должен содержать список.',

    'filter_not_supported' => 'Фильтр по полю :attribute недоступен.',
    'operation_not_exists' => 'Фильтр по полю :attribute содержит несуществующую операцию.',
    'operation_not_supported' => 'Фильтр по полю :attribute не поддерживает указанную операцию.',
    'scope_not_supported' => 'Фильтр по скоупу :scope недоступен.',

    'sort_not_supported' => 'Сортировка по полю :attribute недоступна.',
    'sort_not_exists' => 'Сортировка по полю :attribute содержит несуществующее направление.',

    'per_page' => 'Количество записей на странице должно быть натуральным числом.',
    'page' => 'Номер страницы должен быть натуральным числом.',
    'page_over_last' => 'Несуществующая страница.',
    'page_over_max' => 'Максимально доступная страница - :max.',
];
